[
  {
    "id": 1,
    "title": "Personal Finance Tracker",
    "description": "A modern web application that helps users track personal income and expenses with visual analytics and interactive pie charts showing expense breakdown by category.",
    "detailedDescription": "Personal Finance Tracker is a comprehensive financial management application designed for individuals who want to monitor their spending habits and financial health. The app allows users to input income and expenses, categorize transactions, and view detailed analytics through interactive pie charts and graphs. Key features include real-time expense tracking, income management, visual analytics with Chart.js, dark/light mode toggle, and responsive design for desktop and mobile devices. The application helps users understand their spending patterns, set financial goals, and make informed financial decisions.",
    "technologies": ["Vue.js 3", "TypeScript", "Vite", "Tailwind CSS", "Chart.js", "Vitest", "Playwright"],
    "liveUrl": "https://tracks-finances.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/finance-tracker.jpg",
    "outcomes": "Modern, user-friendly web application with current best practices in frontend development, data visualization, and responsive design. Demonstrates full-stack development capabilities and modern web development practices."
  },
  {
    "id": 2,
    "title": "Fitness Class Scheduler",
    "description": "A modern Angular SSR application for planning weekly fitness classes with dark mode, responsive design, and client-side persistence.",
    "detailedDescription": "Fitness Class Scheduler is a web application designed for fitness instructors and gym owners to manage and schedule weekly fitness classes. The app allows users to add, edit, and remove fitness classes with specific days and times, view schedules in both table and card layouts, and manage class information efficiently. Key features include server-side rendering for fast loading and SEO optimization, dark mode with user preference saving, responsive design for all devices, LocalStorage persistence for data retention, and smooth animations for enhanced user experience. The application is built with Angular 20 and TypeScript for type safety and maintainability.",
    "technologies": [
      "Angular 20",
      "TypeScript",
      "Angular SSR",
      "Node.js",
      "Express",
      "Tailwind CSS",
      "Angular Animations",
      "Signals",
      "LocalStorage",
      "Karma",
      "Jasmine"
    ],
    "liveUrl": "https://fitnessss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/fitness.jpg",
    "outcomes": "Fast, SEO-friendly SSR Angular application with a clean UX, responsive design, and persistent schedule management."
  },
  {
    "id": 3,
    "title": "Habit Tracker & Streak Counter",
    "description": "A Progressive Web App (PWA) for tracking daily habits and building momentum through streak counting with comprehensive analytics and visual charts.",
    "detailedDescription": "Habit Tracker & Streak Counter is a comprehensive productivity application designed to help users build and maintain positive daily habits. The app allows users to create custom habits, track daily completion, and visualize progress through streak counting and analytics dashboards. Key features include habit creation and management, automatic streak calculation, comprehensive analytics with Chart.js visualizations, data persistence using LocalStorage, Progressive Web App capabilities with offline support, glass morphism design elements, and responsive design for all devices. The application helps users stay motivated by providing visual feedback on their progress and maintaining momentum through streak tracking.",
    "technologies": [
      "React 19",
      "Tailwind CSS",
      "React Router DOM",
      "Chart.js",
      "react-chartjs-2",
      "PWA",
      "Service Worker",
      "LocalStorage",
      "Create React App",
      "PostCSS",
      "Autoprefixer",
      "React Testing Library"
    ],
    "liveUrl": "https://habitss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/habit-tracker.jpg",
    "outcomes": "Modern React PWA with data visualization, responsive design, and excellent UX demonstrating proficiency in modern React development, PWA implementation, and user-friendly interface design."
  },
  {
    "id": 4,
    "title": "Event Countdown Timer",
    "description": "A feature-rich countdown timer web application for creating and managing multiple countdowns for various life events with recurring events and smart notifications.",
    "detailedDescription": "Event Countdown Timer is a comprehensive time management application designed to help users track and celebrate important life events. The app allows users to create unlimited countdowns for birthdays, anniversaries, graduations, and custom events with automatic yearly repetition. Key features include multiple countdown views (list and individual), recurring events with daily/weekly/monthly/yearly intervals, visual customization with color coding and themes, smart notifications with confetti animation and audio alerts, LocalStorage data persistence, and URL sharing for specific countdowns. The application is built with vanilla JavaScript for optimal performance and includes modern browser APIs for enhanced functionality.",
    "technologies": [
      "HTML5",
      "CSS3",
      "Vanilla JavaScript",
      "ES6+",
      "localStorage API",
      "Web Audio API",
      "Canvas API",
      "File API",
      "Clipboard API",
      "CSS Grid",
      "Flexbox",
      "CSS Custom Properties",
      "Google Fonts",
      "Netlify"
    ],
    "liveUrl": "https://event-countdowns.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/events.jpg",
    "outcomes": "Lightweight, fast-loading vanilla JavaScript application demonstrating modern web development best practices without frameworks, featuring responsive design, browser APIs integration, and excellent performance."
  },
  {
    "id": 5,
    "title": "Travelogue - Travel Storytelling Website",
    "description": "A comprehensive travel platform featuring interactive world maps, travel stories, destination exploration, and responsive design for travel enthusiasts.",
    "detailedDescription": "Travelogue is a comprehensive travel platform designed for travel enthusiasts who want to explore destinations, read travel stories, and discover new places. The website features an interactive world map with clickable destination markers and popups, allowing users to explore different locations and read detailed travel experiences. Key features include a hero section with call-to-action, masonry-style photo grid with lightbox modal for full-size image viewing, blog-style layout showcasing travel stories, interactive world map using Leaflet.js and OpenStreetMap, personal bio and mission statement, dark/light theme toggle with LocalStorage persistence, and responsive design for all devices. The platform serves as both a travel blog and destination discovery tool.",
    "technologies": [
      "React 18",
      "Create React App",
      "Tailwind CSS 3.3.0",
      "PostCSS",
      "React Router DOM",
      "BrowserRouter",
      "React Context API",
      "Leaflet.js",
      "React-Leaflet",
      "OpenStreetMap",
      "npm",
      "ESLint",
      "Webpack",
      "Vercel",
      "GitHub",
      "Unsplash API"
    ],
    "liveUrl": "https://travelslogue.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/travel.jpg",
    "outcomes": "Modern, scalable travel website with excellent performance, user experience, and maintainability. Demonstrates proficiency in React development, interactive maps integration, responsive design, and modern web development practices."
  },
  {
    "id": 6,
    "title": "Rasoha Academy - School Website",
    "description": "A modern, responsive website for a private school in Narok, Kenya, providing comprehensive information about programs, events, and resources for students and parents.",
    "detailedDescription": "Rasoha Academy website is the official online presence for a private school located in Narok, Kenya, designed to provide comprehensive information for students, parents, and the community. The website serves as a central hub for school information, featuring detailed pages about academic programs, school history and mission, upcoming events and announcements, photo gallery showcasing school activities, contact information and location details, downloads section for forms and documents, and FAQ section for common questions. Key features include Progressive Web App (PWA) capabilities for offline access, SEO optimization for better search visibility, responsive design for all devices, and modern web technologies for fast loading and excellent user experience.",
    "technologies": [
      "React 19.1.1",
      "React Router DOM 7.7.1",
      "React Scripts 5.0.1",
      "Tailwind CSS 3.4.17",
      "PostCSS 8.5.6",
      "Autoprefixer 10.4.21",
      "React Icons 5.5.0",
      "AOS 2.3.4",
      "React CountUp 6.5.3",
      "React Responsive Carousel 3.2.23",
      "React Scroll Parallax 3.4.5",
      "React Helmet 6.1.0",
      "React i18next 15.6.1",
      "Web Vitals 2.1.4",
      "ESLint",
      "Jest",
      "Testing Library",
      "Netlify",
      "Service Worker",
      "Gzip/Brotli Compression"
    ],
    "liveUrl": "https://rasoha.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/rasoha.jpg",
    "outcomes": "Fast, accessible, and SEO-optimized school website with high performance scores, excellent user experience across all devices, and comprehensive PWA features demonstrating modern web development best practices."
  },
  {
    "id": 7,
    "title": "Attendance System - Full Stack Application",
    "description": "A comprehensive full-stack attendance management system for educational institutions with secure authentication, student management, and performance analytics.",
    "detailedDescription": "Attendance System is a comprehensive full-stack web application designed for educational institutions to manage student attendance, track performance, and generate detailed reports. The system provides a complete solution for schools and universities to monitor student attendance patterns, manage student records, and analyze performance data. Key features include secure user authentication using JWT tokens, comprehensive student management (add, edit, delete, view records), daily attendance tracking and management, class organization and scheduling, performance analytics with statistics and detailed reports, responsive design for all devices, and dark mode theme toggle. The application is built with React.js frontend and Node.js backend with MongoDB database for scalability and performance.",
    "technologies": [
      "React.js",
      "Create React App",
      "Tailwind CSS",
      "React Router",
      "Axios",
      "React Hot Toast",
      "Context API",
      "Netlify",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "JWT",
      "bcryptjs",
      "CORS",
      "Helmet",
      "Express Rate Limit",
      "Render",
      "Git",
      "GitHub",
      "Environment Variables",
      "PostCSS",
      "Autoprefixer"
    ],
    "liveUrl": "https://attendance-syst.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/attendance.jpg",
    "outcomes": "Production-ready full-stack application demonstrating modern web development practices with focus on security, scalability, and user experience. Shows proficiency in both frontend and backend development, database management, and deployment strategies."
  },
  {
    "id": 8,
    "title": "E-Learning Platform - Full Stack Application",
    "description": "A comprehensive e-learning platform enabling instructors to create and manage courses while allowing students to enroll, learn, and track their progress.",
    "detailedDescription": "E-Learning Platform is a comprehensive full-stack learning management system designed for educational institutions and online learning providers. The platform enables instructors to create, manage, and deliver online courses while providing students with tools to enroll, access learning materials, and track their educational progress. Key features include secure user authentication with JWT tokens, comprehensive course creation and management tools for instructors, lesson upload and organization capabilities, student enrollment and registration system, detailed progress tracking and analytics, responsive web interface for all devices, real-time API communication, and scalable architecture designed for both instructors and students. The application is built with React frontend and Django backend for robust performance and maintainability.",
    "technologies": [
      "React",
      "TypeScript",
      "Axios",
      "React Router",
      "Tailwind CSS",
      "Netlify",
      "Django",
      "Django REST Framework",
      "Django CORS Headers",
      "Django Simple JWT",
      "SQLite",
      "PostgreSQL",
      "Gunicorn",
      "WhiteNoise",
      "Render"
    ],
    "liveUrl": "https://e-learningdash.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/elearn.jpg",
    "outcomes": "Production-ready full-stack e-learning platform demonstrating modern web development practices with focus on user experience, scalability, and maintainability. Shows proficiency in both frontend and backend development, API design, and deployment strategies."
  },
  {
    "id": 9,
    "title": "TaskForge - Modern Task & Project Management Platform - Full Stack Application",
    "description": "A comprehensive, modern task and project management platform designed for teams to collaborate efficiently, track progress, and achieve their goals faster with real-time updates and advanced analytics.",
    "detailedDescription": "TaskForge is a comprehensive, modern task and project management platform designed for teams to collaborate efficiently, track progress, and achieve their goals faster. Built with cutting-edge technologies, it provides a seamless experience for managing projects, tasks, and team collaboration in real-time. Key features include Kanban board management with drag-and-drop functionality, real-time team collaboration with live updates via WebSocket connections, comprehensive analytics and insights with progress tracking, secure JWT-based authentication with role-based access control, responsive design that works seamlessly across all devices, project timeline management with calendar view and deadline tracking, document management with file uploads and project documentation, and modern UI/UX with beautiful, intuitive interface and smooth animations. The application follows a modern full-stack architecture with Next.js 14 frontend, Node.js with Express.js backend, MongoDB database, Socket.io for real-time communication, and Zustand for client-side state management.",
    "technologies": [
      "Next.js 14",
      "React 18",
      "TypeScript",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "Socket.io",
      "JWT",
      "Zustand",
      "Tailwind CSS",
      "Framer Motion",
      "React Beautiful DnD",
      "Recharts",
      "Axios",
      "bcryptjs",
      "Multer",
      "Helmet",
      "CORS"
    ],
    "liveUrl": "https://taskfoge.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/taskforge.jpg",
    "outcomes": "Modern, production-ready full-stack project management platform demonstrating advanced web development practices with real-time collaboration, comprehensive analytics, and scalable architecture. Shows proficiency in modern React development, real-time communication, database design, and deployment strategies."
  }
]
