[
  {
    "id": 1,
    "title": "Personal Finance Tracker",
    "description": "A modern, responsive web application that helps users track their personal income and expenses with visual analytics.",
    "detailedDescription": "Built a comprehensive financial management tool with interactive pie charts showing expense breakdown by category. The app provides an intuitive interface for managing financial transactions and gaining insights into spending patterns through interactive charts. Features include real-time expense analytics, dark/light mode toggle, and responsive design that works seamlessly on desktop and mobile devices.",
    "technologies": ["Vue.js 3", "TypeScript", "Vite", "Tailwind CSS", "Chart.js", "Vitest", "Playwright"],
    "liveUrl": "https://tracks-finances.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/finance-tracker.jpg",
    "outcomes": "Modern, user-friendly web application with current best practices in frontend development, data visualization, and responsive design. Demonstrates full-stack development capabilities and modern web development practices."
  },
  {
    "id": 2,
    "title": "Fitness Class Scheduler",
    "description": "A modern Angular SSR app for planning weekly fitness classes with dark mode, responsive Tailwind styling, and client-side persistence.",
    "detailedDescription": "Users can add classes with day and time, view the schedule in a table or card layout, and remove entries. The app supports dark mode with saved preference, subtle animations, and LocalStorage persistence. It is server-side rendered for fast first paint and SEO, then hydrates on the client.",
    "technologies": [
      "Angular 20",
      "TypeScript",
      "Angular SSR",
      "Node.js",
      "Express",
      "Tailwind CSS",
      "Angular Animations",
      "Signals",
      "LocalStorage",
      "Karma",
      "Jasmine"
    ],
    "liveUrl": "https://fitnessss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/fitness.jpg",
    "outcomes": "Fast, SEO-friendly SSR Angular application with a clean UX, responsive design, and persistent schedule management."
  },
  {
    "id": 3,
    "title": "Habit Tracker & Streak Counter",
    "description": "A modern Progressive Web App (PWA) for tracking daily habits and building momentum through streak counting.",
    "detailedDescription": "A beautiful, responsive web application that helps users build and maintain daily habits through visual tracking and streak counting. The app features a clean, modern interface with glass morphism design elements and provides comprehensive analytics to help users stay motivated. Features include habit management, automatic streak calculation, analytics dashboard with visual charts, data persistence with local storage, and full PWA capabilities with offline support.",
    "technologies": [
      "React 19",
      "Tailwind CSS",
      "React Router DOM",
      "Chart.js",
      "react-chartjs-2",
      "PWA",
      "Service Worker",
      "LocalStorage",
      "Create React App",
      "PostCSS",
      "Autoprefixer",
      "React Testing Library"
    ],
    "liveUrl": "https://habitss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/habit-tracker.jpg",
    "outcomes": "Modern React PWA with data visualization, responsive design, and excellent UX demonstrating proficiency in modern React development, PWA implementation, and user-friendly interface design."
  },
  {
    "id": 4,
    "title": "Event Countdown Timer",
    "description": "A modern, feature-rich countdown timer web application for creating and managing multiple countdowns for various life events.",
    "detailedDescription": "Perfect for tracking birthdays, anniversaries, graduations, and custom recurring events with automatic yearly repetition. Features include unlimited countdowns with list and individual views, recurring events with daily/weekly/monthly/yearly intervals, visual customization with color coding and themes, smart notifications with confetti animation and audio alerts, localStorage data persistence, and URL sharing for specific countdowns.",
    "technologies": [
      "HTML5",
      "CSS3",
      "Vanilla JavaScript",
      "ES6+",
      "localStorage API",
      "Web Audio API",
      "Canvas API",
      "File API",
      "Clipboard API",
      "CSS Grid",
      "Flexbox",
      "CSS Custom Properties",
      "Google Fonts",
      "Netlify"
    ],
    "liveUrl": "https://event-countdowns.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/events.jpg",
    "outcomes": "Lightweight, fast-loading vanilla JavaScript application demonstrating modern web development best practices without frameworks, featuring responsive design, browser APIs integration, and excellent performance."
  },
  {
    "id": 5,
    "title": "Travelogue - Travel Storytelling Website",
    "description": "A beautiful, modern travel storytelling website that allows users to explore destinations around the world, read travel stories, and discover new places through an interactive world map.",
    "detailedDescription": "Travelogue is a comprehensive travel platform featuring a responsive design with smooth animations, dark/light theme support, and a user-friendly interface for travel enthusiasts. The website includes a hero section with call-to-action, masonry-style photo grid with lightbox modal for full-size image viewing, blog-style layout showcasing travel experiences, interactive world map with clickable destination markers and popups, personal bio and mission statement, and theme toggle with localStorage persistence.",
    "technologies": [
      "React 18",
      "Create React App",
      "Tailwind CSS 3.3.0",
      "PostCSS",
      "React Router DOM",
      "BrowserRouter",
      "React Context API",
      "Leaflet.js",
      "React-Leaflet",
      "OpenStreetMap",
      "npm",
      "ESLint",
      "Webpack",
      "Vercel",
      "GitHub",
      "Unsplash API"
    ],
    "liveUrl": "https://travelslogue.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/travel.jpg",
    "outcomes": "Modern, scalable travel website with excellent performance, user experience, and maintainability. Demonstrates proficiency in React development, interactive maps integration, responsive design, and modern web development practices."
  },
  {
    "id": 6,
    "title": "Rasoha Academy - School Website",
    "description": "A modern, responsive website for a private school located in Narok, Kenya, serving as the official online presence for the academy.",
    "detailedDescription": "Rasoha Academy website provides comprehensive information about the school, its programs, events, and resources for students, parents, and the community. Features include homepage with school overview and highlights, about page with school history and mission, events calendar and announcements, photo gallery showcasing school activities, contact information and location details, downloads section for forms and documents, FAQ section for common questions, and Progressive Web App (PWA) capabilities.",
    "technologies": [
      "React 19.1.1",
      "React Router DOM 7.7.1",
      "React Scripts 5.0.1",
      "Tailwind CSS 3.4.17",
      "PostCSS 8.5.6",
      "Autoprefixer 10.4.21",
      "React Icons 5.5.0",
      "AOS 2.3.4",
      "React CountUp 6.5.3",
      "React Responsive Carousel 3.2.23",
      "React Scroll Parallax 3.4.5",
      "React Helmet 6.1.0",
      "React i18next 15.6.1",
      "Web Vitals 2.1.4",
      "ESLint",
      "Jest",
      "Testing Library",
      "Netlify",
      "Service Worker",
      "Gzip/Brotli Compression"
    ],
    "liveUrl": "https://rasoha.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/rasoha.jpg",
    "outcomes": "Fast, accessible, and SEO-optimized school website with high performance scores, excellent user experience across all devices, and comprehensive PWA features demonstrating modern web development best practices."
  },
  {
    "id": 7,
    "title": "Attendance System - Full Stack Application",
    "description": "A modern, responsive web application for managing student attendance and performance tracking with comprehensive analytics and reporting.",
    "detailedDescription": "A full-stack attendance management system providing a comprehensive solution for educational institutions to monitor student attendance, manage student records, and generate attendance reports. Features include secure user authentication with JWT tokens, student management (add, edit, delete, view records), attendance tracking and management, class organization, performance analytics with statistics and reports, responsive design for all devices, and dark mode theme toggle.",
    "technologies": [
      "React.js",
      "Create React App",
      "Tailwind CSS",
      "React Router",
      "Axios",
      "React Hot Toast",
      "Context API",
      "Netlify",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "JWT",
      "bcryptjs",
      "CORS",
      "Helmet",
      "Express Rate Limit",
      "Render",
      "Git",
      "GitHub",
      "Environment Variables",
      "PostCSS",
      "Autoprefixer"
    ],
    "liveUrl": "https://attendance-syst.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/attendance.jpg",
    "outcomes": "Production-ready full-stack application demonstrating modern web development practices with focus on security, scalability, and user experience. Shows proficiency in both frontend and backend development, database management, and deployment strategies."
  }
]
