[
  {
    "id": 1,
    "title": "Personal Finance Tracker",
    "type": "frontend",
    "description": "A modern web application that helps users track personal income and expenses with visual analytics and interactive pie charts showing expense breakdown by category.",
    "detailedDescription": "Personal Finance Tracker is a comprehensive financial management application designed for individuals who want to monitor their spending habits and financial health. The app allows users to input income and expenses, categorize transactions, and view detailed analytics through interactive pie charts and graphs. Key features include real-time expense tracking, income management, visual analytics with Chart.js, dark/light mode toggle, and responsive design for desktop and mobile devices. The application helps users understand their spending patterns, set financial goals, and make informed financial decisions.",
    "technologies": ["Vue.js 3", "TypeScript", "Vite", "Tailwind CSS", "Chart.js", "Vitest", "Playwright"],
    "liveUrl": "https://tracks-finances.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/finance-tracker.jpg",
    "outcomes": "Modern, user-friendly web application with current best practices in frontend development, data visualization, and responsive design. Demonstrates full-stack development capabilities and modern web development practices."
  },
  {
    "id": 2,
    "title": "Fitness Class Scheduler",
    "type": "frontend",
    "description": "A modern Angular SSR application for planning weekly fitness classes with dark mode, responsive design, and client-side persistence.",
    "detailedDescription": "Fitness Class Scheduler is a web application designed for fitness instructors and gym owners to manage and schedule weekly fitness classes. The app allows users to add, edit, and remove fitness classes with specific days and times, view schedules in both table and card layouts, and manage class information efficiently. Key features include server-side rendering for fast loading and SEO optimization, dark mode with user preference saving, responsive design for all devices, LocalStorage persistence for data retention, and smooth animations for enhanced user experience. The application is built with Angular 20 and TypeScript for type safety and maintainability.",
    "technologies": [
      "Angular 20",
      "TypeScript",
      "Angular SSR",
      "Node.js",
      "Express",
      "Tailwind CSS",
      "Angular Animations",
      "Signals",
      "LocalStorage",
      "Karma",
      "Jasmine"
    ],
    "liveUrl": "https://fitnessss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/fitness.jpg",
    "outcomes": "Fast, SEO-friendly SSR Angular application with a clean UX, responsive design, and persistent schedule management."
  },
  {
    "id": 3,
    "title": "Habit Tracker & Streak Counter",
    "type": "frontend",
    "description": "A Progressive Web App (PWA) for tracking daily habits and building momentum through streak counting with comprehensive analytics and visual charts.",
    "detailedDescription": "Habit Tracker & Streak Counter is a comprehensive productivity application designed to help users build and maintain positive daily habits. The app allows users to create custom habits, track daily completion, and visualize progress through streak counting and analytics dashboards. Key features include habit creation and management, automatic streak calculation, comprehensive analytics with Chart.js visualizations, data persistence using LocalStorage, Progressive Web App capabilities with offline support, glass morphism design elements, and responsive design for all devices. The application helps users stay motivated by providing visual feedback on their progress and maintaining momentum through streak tracking.",
    "technologies": [
      "React 19",
      "Tailwind CSS",
      "React Router DOM",
      "Chart.js",
      "react-chartjs-2",
      "PWA",
      "Service Worker",
      "LocalStorage",
      "Create React App",
      "PostCSS",
      "Autoprefixer",
      "React Testing Library"
    ],
    "liveUrl": "https://habitss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/habit-tracker.jpg",
    "outcomes": "Modern React PWA with data visualization, responsive design, and excellent UX demonstrating proficiency in modern React development, PWA implementation, and user-friendly interface design."
  },
  {
    "id": 4,
    "title": "Event Countdown Timer",
    "type": "frontend",
    "description": "A feature-rich countdown timer web application for creating and managing multiple countdowns for various life events with recurring events and smart notifications.",
    "detailedDescription": "Event Countdown Timer is a comprehensive time management application designed to help users track and celebrate important life events. The app allows users to create unlimited countdowns for birthdays, anniversaries, graduations, and custom events with automatic yearly repetition. Key features include multiple countdown views (list and individual), recurring events with daily/weekly/monthly/yearly intervals, visual customization with color coding and themes, smart notifications with confetti animation and audio alerts, LocalStorage data persistence, and URL sharing for specific countdowns. The application is built with vanilla JavaScript for optimal performance and includes modern browser APIs for enhanced functionality.",
    "technologies": [
      "HTML5",
      "CSS3",
      "Vanilla JavaScript",
      "ES6+",
      "localStorage API",
      "Web Audio API",
      "Canvas API",
      "File API",
      "Clipboard API",
      "CSS Grid",
      "Flexbox",
      "CSS Custom Properties",
      "Google Fonts",
      "Netlify"
    ],
    "liveUrl": "https://event-countdowns.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/events.jpg",
    "outcomes": "Lightweight, fast-loading vanilla JavaScript application demonstrating modern web development best practices without frameworks, featuring responsive design, browser APIs integration, and excellent performance."
  },
  {
    "id": 5,
    "title": "Travelogue - Travel Storytelling Website",
    "type": "frontend",
    "description": "A comprehensive travel platform featuring interactive world maps, travel stories, destination exploration, and responsive design for travel enthusiasts.",
    "detailedDescription": "Travelogue is a comprehensive travel platform designed for travel enthusiasts who want to explore destinations, read travel stories, and discover new places. The website features an interactive world map with clickable destination markers and popups, allowing users to explore different locations and read detailed travel experiences. Key features include a hero section with call-to-action, masonry-style photo grid with lightbox modal for full-size image viewing, blog-style layout showcasing travel stories, interactive world map using Leaflet.js and OpenStreetMap, personal bio and mission statement, dark/light theme toggle with LocalStorage persistence, and responsive design for all devices. The platform serves as both a travel blog and destination discovery tool.",
    "technologies": [
      "React 18",
      "Create React App",
      "Tailwind CSS 3.3.0",
      "PostCSS",
      "React Router DOM",
      "BrowserRouter",
      "React Context API",
      "Leaflet.js",
      "React-Leaflet",
      "OpenStreetMap",
      "npm",
      "ESLint",
      "Webpack",
      "Vercel",
      "GitHub",
      "Unsplash API"
    ],
    "liveUrl": "https://travelslogue.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/travel.jpg",
    "outcomes": "Modern, scalable travel website with excellent performance, user experience, and maintainability. Demonstrates proficiency in React development, interactive maps integration, responsive design, and modern web development practices."
  },
  {
    "id": 6,
    "title": "Rasoha Academy - School Website",
    "type": "frontend",
    "description": "A modern, responsive website for a private school in Narok, Kenya, providing comprehensive information about programs, events, and resources for students and parents.",
    "detailedDescription": "Rasoha Academy website is the official online presence for a private school located in Narok, Kenya, designed to provide comprehensive information for students, parents, and the community. The website serves as a central hub for school information, featuring detailed pages about academic programs, school history and mission, upcoming events and announcements, photo gallery showcasing school activities, contact information and location details, downloads section for forms and documents, and FAQ section for common questions. Key features include Progressive Web App (PWA) capabilities for offline access, SEO optimization for better search visibility, responsive design for all devices, and modern web technologies for fast loading and excellent user experience.",
    "technologies": [
      "React 19.1.1",
      "React Router DOM 7.7.1",
      "React Scripts 5.0.1",
      "Tailwind CSS 3.4.17",
      "PostCSS 8.5.6",
      "Autoprefixer 10.4.21",
      "React Icons 5.5.0",
      "AOS 2.3.4",
      "React CountUp 6.5.3",
      "React Responsive Carousel 3.2.23",
      "React Scroll Parallax 3.4.5",
      "React Helmet 6.1.0",
      "React i18next 15.6.1",
      "Web Vitals 2.1.4",
      "ESLint",
      "Jest",
      "Testing Library",
      "Netlify",
      "Service Worker",
      "Gzip/Brotli Compression"
    ],
    "liveUrl": "https://rasoha.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/rasoha.jpg",
    "outcomes": "Fast, accessible, and SEO-optimized school website with high performance scores, excellent user experience across all devices, and comprehensive PWA features demonstrating modern web development best practices."
  },
  {
    "id": 7,
    "title": "Attendance System - Full Stack Application",
    "type": "fullstack",
    "description": "A resilient attendance management system architected for educational institutions to automate attendance tracking, provide comprehensive analytics, and generate detailed reports. The system handles 500+ active users across multiple institutions with 95% accuracy improvement and 70% reduction in administrative overhead.",
    "detailedDescription": "A resilient attendance management system architected for educational institutions to automate attendance tracking, provide comprehensive analytics, and generate detailed reports. The system handles 500+ active users across multiple institutions with 95% accuracy improvement and 70% reduction in administrative overhead. The architecture follows a three-tier design: React frontend, Node.js/Express API layer, and MongoDB database. Service isolation is achieved through Express route middleware, separating authentication, attendance tracking, and reporting logic. Database operations use MongoDB transactions for atomic updates, with connection pooling preventing connection exhaustion. The system supports multi-institution deployment through organization-scoped data isolation, with MongoDB indexing optimizing query performance for large datasets.",
    "technologies": [
      "React.js",
      "Create React App",
      "Tailwind CSS",
      "React Router",
      "Axios",
      "React Hot Toast",
      "Context API",
      "Netlify",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "JWT",
      "bcryptjs",
      "CORS",
      "Helmet",
      "Express Rate Limit",
      "Render",
      "Git",
      "GitHub",
      "Environment Variables",
      "PostCSS",
      "Autoprefixer"
    ],
    "liveUrl": "https://attendance-syst.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/attendance.jpg",
    "outcomes": "95% improvement in attendance tracking accuracy with automated systems, 70% reduction in administrative time through streamlined workflows. Comprehensive analytics and reporting capabilities with 15+ report types. Vision includes scaling to 10,000+ users through MongoDB sharding, Redis caching, and microservices extraction for analytics and notifications."
  },
  {
    "id": 8,
    "title": "E-Learning Platform - Full Stack Application",
    "type": "fullstack",
    "description": "A resilient, scalable learning management system architected to handle thousands of concurrent students and hundreds of courses. The platform enables educational institutions to deliver online education at scale with sub-2-second page loads, comprehensive course management, and real-time progress tracking.",
    "detailedDescription": "A resilient, scalable learning management system architected to handle thousands of concurrent students and hundreds of courses. The platform enables educational institutions to deliver online education at scale with sub-2-second page loads, comprehensive course management, and real-time progress tracking. The system follows a layered architecture with Django REST Framework backend and React frontend. PostgreSQL serves as the primary relational database with optimized indexes. Django ORM uses select_related and prefetch_related to minimize database roundtrips. Service isolation is achieved through Django's app-based architecture, where course management, user authentication, and progress tracking are separated into distinct modules. The architecture supports horizontal scaling through Django's stateless design and PostgreSQL read replicas.",
    "technologies": [
      "React",
      "TypeScript",
      "Axios",
      "React Router",
      "Tailwind CSS",
      "Netlify",
      "Django",
      "Django REST Framework",
      "Django CORS Headers",
      "Django Simple JWT",
      "SQLite",
      "PostgreSQL",
      "Gunicorn",
      "WhiteNoise",
      "Render"
    ],
    "liveUrl": "https://e-learningdash.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/elearn.jpg",
    "outcomes": "Platform handles 10,000+ students and 500+ courses with consistent sub-2-second page load times. Stress-tested to handle 1,000+ concurrent users with 99.9% uptime. Optimized database queries reduce load times by 70% compared to baseline implementations. Vision includes scaling to 100,000+ students through Redis caching, CDN integration, and microservices extraction."
  },
  {
    "id": 9,
    "title": "TaskForge - Modern Task & Project Management Platform - Full Stack Application",
    "type": "fullstack",
    "description": "A resilient, scalable real-time collaborative project management platform designed for engineering teams. The system handles concurrent collaboration across distributed teams, managing project workflows, task coordination, and team communication with sub-second latency and conflict-free synchronization.",
    "detailedDescription": "TaskForge is a resilient, scalable real-time collaborative project management platform designed for engineering teams. The system handles concurrent collaboration across distributed teams, managing project workflows, task coordination, and team communication with sub-second latency and conflict-free synchronization. The platform supports real-time collaboration with sub-500ms latency and handles 100+ concurrent users per project without performance degradation. The architecture follows a microservices-inspired design with clear service boundaries, MongoDB for primary database with optimized indexing, pub-sub pattern via Socket.io for event distribution, and horizontal scaling through stateless API servers and MongoDB replica sets. Components are isolated through service boundaries, ensuring API failures don't block WebSocket communication, with automatic reconnection logic and exponential backoff for network resilience.",
    "technologies": [
      "Next.js 14",
      "React 18",
      "TypeScript",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "Socket.io",
      "JWT",
      "Zustand",
      "Tailwind CSS",
      "Framer Motion",
      "React Beautiful DnD",
      "Recharts",
      "Axios",
      "bcryptjs",
      "Multer",
      "Helmet",
      "CORS"
    ],
    "liveUrl": "https://taskfoge.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/taskforge.jpg",
    "outcomes": "Production-ready platform with 99.9% uptime, comprehensive error handling, and graceful reconnection strategies. Demonstrates enterprise-grade reliability with real-time collaboration capabilities, fault tolerance, and graceful degradation. Vision includes horizontal scaling to 10,000+ concurrent users through Redis pub-sub, read replicas, and CDN integration."
  }
  ,
  {
    "id": 10,
    "title": "Banking System",
    "type": "frontend",
    "description": "A console-based Banking System built in Java to demonstrate core Object-Oriented Programming principles (Encapsulation, Inheritance, Abstraction, Polymorphism).",
    "detailedDescription": "A simple, console-based Banking System implemented in pure Java (no external APIs, no DB, no frameworks). It demonstrates core OOP principles through account operations and customer management. Features include creating customers, opening savings/checking accounts, depositing, withdrawing, transferring, and viewing balances and transactions.",
    "technologies": ["Java 17+", "OOP", "Maven (optional)", "Gradle (optional)"],
    "liveUrl": "",
    "repoUrl": "https://github.com/Ancel-duke/banking",
    "image": "/assets/projects/bank.jpg",
    "outcomes": "Clean OOP design showcasing encapsulation, inheritance, abstraction, and polymorphism; fully offline and lightweight; ideal for demonstrating problem-solving and software design skills."
  },
  {
    "id": 11,
    "title": "EduChain - Blockchain Certificate Management",
    "type": "fullstack",
    "description": "A resilient, decentralized certificate management system architected on Web3 principles, issuing verifiable academic certificates as ERC721 NFTs on the Ethereum blockchain. The platform enables educational institutions to issue tamper-proof, blockchain-verified certificates while providing students with permanent, verifiable proof of achievements through hybrid storage (MongoDB + IPFS + Blockchain).",
    "detailedDescription": "EduChain is a resilient, decentralized certificate management system architected on Web3 principles, issuing verifiable academic certificates as ERC721 NFTs on the Ethereum blockchain. The platform enables educational institutions to issue tamper-proof, blockchain-verified certificates while providing students with permanent, verifiable proof of achievements through hybrid storage (MongoDB + IPFS + Blockchain). The architecture follows a hybrid storage design: React 19 frontend with RainbowKit for wallet connection, Node.js/Express backend for certificate management, MongoDB for efficient querying, IPFS (via Pinata API) for decentralized metadata storage, and Ethereum blockchain (Sepolia testnet) for immutable certificate verification. Smart contracts use OpenZeppelin v5 ERC721 standard with ReentrancyGuard protection. Service isolation is achieved through separate layers: frontend wallet interactions are isolated from backend API calls, IPFS operations are handled asynchronously, and database operations use MongoDB transactions for atomic batch operations.",
    "technologies": [
      "React 19",
      "Tailwind CSS",
      "RainbowKit",
      "Wagmi",
      "ethers.js v6",
      "React Router",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "IPFS",
      "Pinata API",
      "Solidity 0.8.20",
      "Hardhat",
      "OpenZeppelin v5",
      "Netlify",
      "Render"
    ],
    "liveUrl": "https://educhainn.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke/EduChain",
    "image": "/assets/projects/EduChain.jpg",
    "outcomes": "Secure, decentralized solution for certificate management with instant verification capabilities. Uses OpenZeppelin audited patterns for security, includes dual storage (MongoDB for queries, IPFS for metadata, Blockchain for verification), and demonstrates production-grade Web3 architecture. Vision includes multi-chain deployment (Polygon, Arbitrum), certificate revocation mechanism, and enterprise features like institution-specific smart contracts."
  },
  {
    "id": 12,
    "title": "LedgerX - Finance Management Application",
    "type": "fullstack",
    "description": "LedgerX is a production-grade, multi-tenant financial platform for invoicing, payments, double-entry accounting, audit/compliance, fraud detection, and system diagnostics—designed to be auditable, resilient, secure, and operationally observable.",
    "detailedDescription": "LedgerX is a production-grade, multi-tenant financial platform designed to handle invoicing, payments, accounting (double-entry ledger), audit/compliance, fraud detection, and system diagnostics in a single, cohesive system. Design goals: strong multi-tenant isolation (every request and query is organization-scoped), auditability by default (important actions are events and recorded), financial correctness (payments reflected in a true double-entry ledger with append-only hash chain), resilience under failure (circuit breakers, graceful degradation), operational visibility (health, metrics, diagnostics, feature flags, controlled remediation), and security that earns respect (JWT + refresh, token versioning, rate limiting, role-restricted audit/diagnostics). Backend: NestJS, PostgreSQL (Prisma), MongoDB (activity logs). Frontend: Next.js 14 App Router, React 18, TanStack Query. Payments: Stripe and M-Pesa adapters, idempotent intents, verified webhooks. Deployed on Render (backend) and Netlify (frontend).",
    "technologies": [
      "Next.js 14",
      "React 18",
      "TypeScript",
      "NestJS",
      "PostgreSQL",
      "Prisma",
      "MongoDB",
      "Mongoose",
      "JWT",
      "Passport.js",
      "TanStack Query",
      "Recharts",
      "Tailwind CSS",
      "Axios",
      "Stripe",
      "M-Pesa",
      "Render",
      "Netlify"
    ],
    "liveUrl": "https://ledgerxx.netlify.app/auth/login",
    "repoUrl": "https://github.com/Ancel-duke/LedgerX",
    "docsUrl": "https://github.com/Ancel-duke/LedgerX/blob/main/ARCHITECTURE.md",
    "image": "/assets/projects/LedgerX.jpg",
    "outcomes": "Production-grade multi-tenant fintech with event-driven core, double-entry ledger, fraud signals, diagnostics and self-protection (health, metrics, feature flags, remediation). Security by design: JWT + token versioning, rate limiting, role-restricted audit/diagnostics, structured logging with secret redaction. Demonstrates senior-level backend architecture, security-first thinking, and operational maturity beyond CRUD."
  },
  {
    "id": 13,
    "title": "OpsFlow",
    "type": "fullstack",
    "description": "A production-ready incident and operations management platform architected for engineering teams, combining incident response, workflow management, task coordination, and knowledge sharing into a single secure team-based system. The platform features dual-database architecture (PostgreSQL + MongoDB), real-time WebSocket updates, and team-based multi-tenancy with 50+ API endpoints.",
    "detailedDescription": "OpsFlow is a production-ready incident and operations management platform architected for engineering teams, combining incident response, workflow management, task coordination, and knowledge sharing into a single secure team-based system. The platform features dual-database architecture (PostgreSQL + MongoDB), real-time WebSocket updates, and team-based multi-tenancy with 50+ API endpoints. The system follows a dual-database architecture: PostgreSQL (via Prisma ORM) for structured relational data (incidents, workflows, teams) and MongoDB for append-only event logs and timelines. The backend uses NestJS modular architecture with feature-based modules. Real-time updates are handled through WebSocket connections (Socket.IO) without background workers, computing SLA calculations and breach detection on-demand during API requests. Multi-tenant isolation is enforced at the database query level with team-scoped filtering.",
    "technologies": ["NestJS", "Next.js", "PostgreSQL", "MongoDB", "Prisma", "WebSockets", "JWT", "RBAC", "TypeScript", "Tailwind CSS", "Socket.IO"],
    "liveUrl": "",
    "repoUrl": "https://github.com/Ancel-duke/OpsFlow",
    "image": "/assets/projects/opsflow.jpg",
    "outcomes": "Production-ready system with 50+ API endpoints and real-time incident updates without paid infrastructure. Secure team-based multi-tenant architecture with complete data isolation, fully documented setup and deployment guides, and responsive UI across mobile, tablet, and desktop. Demonstrates enterprise-grade backend and system design skills with real-world SaaS architecture. Vision includes scaling to 1,000+ teams through PostgreSQL read replicas, Redis pub-sub for WebSocket message distribution, and microservices extraction."
  },
  {
    "id": 14,
    "title": "SignFlow",
    "type": "fullstack",
    "description": "A high-fidelity assistive technology platform architected for real-time sign language translation, exploring the architectural requirements for scaling accessibility platforms. The system features WebSocket-powered streaming, 3D avatar simulation with natural variation, and accessibility-first design with WCAG compliance, demonstrating production-grade architecture for specialized user bases.",
    "detailedDescription": "SignFlow is a high-fidelity assistive technology platform architected for real-time sign language translation, exploring the architectural requirements for scaling accessibility platforms. The system features WebSocket-powered streaming, 3D avatar simulation with natural variation, and accessibility-first design with WCAG compliance, demonstrating production-grade architecture for specialized user bases. The architecture follows a real-time streaming design: React frontend with Three.js (React Three Fiber) for 3D avatar rendering, Node.js/Express backend for translation processing, MongoDB Atlas for cloud-hosted data with indexed collections, and WebSocket connections for near-zero latency streaming. Animation pools store multiple variations per word/phrase, with seed-based selection for natural variation. Service isolation is achieved through separate layers: 3D rendering is isolated from translation processing, WebSocket connections are handled independently from REST API routes, and error handling is centralized with custom exception handlers.",
    "technologies": ["React", "Node.js", "Express", "MongoDB", "WebSockets", "Three.js", "React Three Fiber", "JWT", "Recharts", "Framer Motion", "Mongoose"],
    "liveUrl": "",
    "repoUrl": "https://github.com/Ancel-duke/SignFlow",
    "image": "/assets/projects/signflow1.jpg",
    "outcomes": "Fully implemented assistive technology prototype demonstrating real-time system design using WebSockets, scalable cloud architecture with MongoDB Atlas, intentional UX for specialized user bases, and product-level thinking bridging coding projects and viable market solutions. Features high-fidelity 3D avatar simulation, natural variation in animations, comprehensive analytics dashboard, and full WCAG accessibility compliance. Vision includes scaling to 10,000+ concurrent users through WebSocket load balancing, Redis for session management, and CDN integration for 3D assets."
  },
  {
    "id": 15,
    "title": "NestFi",
    "type": "fullstack",
    "description": "NestFi is a resilient financial coordination platform built to handle real-world constraints such as unreliable networks, asynchronous mobile money payments, and partial system failures. It uses a stateless NestJS backend with a hybrid database architecture—PostgreSQL for financial correctness, MongoDB for events and logs, and Redis for low-latency ephemeral state—so failures in non-critical services do not compromise core financial operations.",
    "detailedDescription": "NestFi is a stateless financial platform designed to handle real-world constraints such as unreliable networks, asynchronous M-Pesa payments, and partial system failures. It integrates mobile and web clients with a single NestJS backend and a hybrid database architecture—PostgreSQL for financial correctness (wallets/ledgers), MongoDB for events/logs/payment callbacks, and Redis for low-latency ephemeral state (caching, rate limits, temporary correlation). The system is designed under the assumption that failures are normal, not exceptional: caches can fail, logs can be unavailable, and callbacks can be delayed or duplicated. Each failure mode is handled explicitly with timeouts, retries with backoff, circuit breakers, and graceful degradation. Security-first baselines include JWT authentication, input validation, rate limiting, callback IP allowlisting, network isolation via Docker, and TLS at the edge (Cloudflare). Current status is ~75% complete; core architecture and key integrations are in place, with remaining work focused on frontend polish, an optional KYC module, and operational refinements.",
    "technologies": [
      "NestJS",
      "TypeScript",
      "PostgreSQL",
      "MongoDB",
      "Redis",
      "Docker",
      "Cloudflare Workers",
      "M-Pesa Daraja API",
      "JWT",
      "React Native",
      "Next.js",
      "Turborepo"
    ],
    "liveUrl": "",
    "repoUrl": "https://github.com/Ancel-duke/NestFi",
    "docsUrl": "https://github.com/Ancel-duke/NestFi/blob/main/docs/ARCHITECTURE.md",
    "image": "/assets/projects/nestfi.jpg",
    "outcomes": "Failure-aware, production-grade system design that prioritizes correctness and fault isolation for financial workflows. Hybrid data modeling (PostgreSQL + MongoDB + Redis), idempotent/async callback handling, and security-first controls reflect real payment system constraints. Remaining work is infrastructure hardening and operational refinement rather than core architecture."
  },
  {
    "id": 16,
    "title": "EduManage",
    "type": "fullstack",
    "description": "EduManage is a multi-tenant school management SaaS designed for real-world scale. It enforces tenant isolation, hierarchical RBAC, and failure-aware backend design so multiple institutions can safely share one platform without permission complexity becoming a bottleneck.",
    "detailedDescription": "EduManage solves the hard problem most school systems avoid: running multiple institutions on one platform with strict tenant isolation and complex permissions. The architecture uses a multi-tenant Express/NestJS backend with tenant-scoped access at the data layer, MongoDB for flexible academic domain models, JWT-based stateless authentication with hierarchical RBAC, and Socket.io for real-time events (notifications and updates). The system is designed for graceful degradation under partial failures and is supported by a Dockerized development/deployment workflow. Status: MVP Complete (~85%). Planned but deferred for the next hardening phase: advanced rate limiting, deep automated testing, and caching.",
    "technologies": [
      "NestJS",
      "Express.js",
      "MongoDB",
      "JWT",
      "RBAC",
      "Socket.io",
      "TypeScript",
      "Docker"
    ],
    "liveUrl": "",
    "repoUrl": "https://github.com/Ancel-duke/edumanage",
    "docsUrl": "https://github.com/Ancel-duke/edumanage/blob/main/docs/ARCHITECTURE.md",
    "image": "/assets/projects/edumanage.jpg",
    "outcomes": "Multi-tenant MVP structured for scale: tenant-scoped access, hierarchical permissions, real-time events, and failure-aware service boundaries. Remaining work focuses on hardening (rate limiting, testing, caching) rather than redesigning core architecture."
  },
  {
    "id": 17,
    "title": "Aegis",
    "type": "fullstack",
    "description": "Aegis monitors infrastructure behavior, detects anomalies using AI, evaluates security policies, and executes tightly controlled remediation actions. It is built with strict isolation boundaries, auditability, and failure-aware automation to avoid unsafe self-healing.",
    "detailedDescription": "Aegis is a self-healing infrastructure platform that combines policy-driven access control, ML-based anomaly and failure detection, and safe Kubernetes remediation. It addresses reacting to infrastructure failures and anomalies in a governed, auditable way: instead of ad-hoc scripts or manual intervention, operators define policies that determine which automated actions are allowed, and an AI engine recommends actions that an executor can perform only after policy evaluation and signature validation. Core services include a NestJS backend (auth, policies, audit, APIs), Python/FastAPI AI engine (anomaly detection and recommendations), standalone NestJS executor (secure Kubernetes actions), and Next.js frontend for observability and control plane UI. Security guarantees: no unaudited actions, no blind AI execution, no privilege escalation, no silent failures—JWT + RBAC, HMAC-signed executor actions, namespace allowlisting, immutable audit logs, default-deny network policies.",
    "technologies": [
      "NestJS",
      "FastAPI",
      "Next.js",
      "PostgreSQL",
      "Redis",
      "Kubernetes",
      "Docker",
      "Prometheus",
      "Grafana",
      "Loki",
      "Tempo",
      "Python",
      "TypeScript",
      "JWT",
      "HMAC",
      "RBAC"
    ],
    "liveUrl": "",
    "repoUrl": "https://github.com/Ancel-duke/Aegis",
    "docsUrl": "https://github.com/Ancel-duke/Aegis/blob/main/ARCHITECTURE.md",
    "image": "/assets/projects/aegis.jpg",
    "outcomes": "Aegis reflects how I think about production systems: assume failure, design for abuse, automate carefully, and leave a trail of evidence for every decision. Implemented (~95%): backend APIs and security, AI anomaly detection, executor with Kubernetes RBAC, full observability stack, production-ready frontend, Docker and Kubernetes manifests, CI/CD with rollback."
  }
]
