[
  {
    "id": 1,
    "title": "Personal Finance Tracker",
    "description": "A modern, responsive web application that helps users track their personal income and expenses with visual analytics.",
    "detailedDescription": "Built a comprehensive financial management tool with interactive pie charts showing expense breakdown by category. The app provides an intuitive interface for managing financial transactions and gaining insights into spending patterns through interactive charts. Features include real-time expense analytics, dark/light mode toggle, and responsive design that works seamlessly on desktop and mobile devices.",
    "technologies": ["Vue.js 3", "TypeScript", "Vite", "Tailwind CSS", "Chart.js", "Vitest", "Playwright"],
    "liveUrl": "https://tracks-finances.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/finance-tracker.jpg",
    "outcomes": "Modern, user-friendly web application with current best practices in frontend development, data visualization, and responsive design. Demonstrates full-stack development capabilities and modern web development practices."
  },
  {
    "id": 2,
    "title": "Fitness Class Scheduler",
    "description": "A modern Angular SSR app for planning weekly fitness classes with dark mode, responsive Tailwind styling, and client-side persistence.",
    "detailedDescription": "Users can add classes with day and time, view the schedule in a table or card layout, and remove entries. The app supports dark mode with saved preference, subtle animations, and LocalStorage persistence. It is server-side rendered for fast first paint and SEO, then hydrates on the client.",
    "technologies": [
      "Angular 20",
      "TypeScript",
      "Angular SSR",
      "Node.js",
      "Express",
      "Tailwind CSS",
      "Angular Animations",
      "Signals",
      "LocalStorage",
      "Karma",
      "Jasmine"
    ],
    "liveUrl": "https://fitnessss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/fitness.jpg",
    "outcomes": "Fast, SEO-friendly SSR Angular application with a clean UX, responsive design, and persistent schedule management."
  },
  {
    "id": 3,
    "title": "Habit Tracker & Streak Counter",
    "description": "A modern Progressive Web App (PWA) for tracking daily habits and building momentum through streak counting.",
    "detailedDescription": "A beautiful, responsive web application that helps users build and maintain daily habits through visual tracking and streak counting. The app features a clean, modern interface with glass morphism design elements and provides comprehensive analytics to help users stay motivated. Features include habit management, automatic streak calculation, analytics dashboard with visual charts, data persistence with local storage, and full PWA capabilities with offline support.",
    "technologies": [
      "React 19",
      "Tailwind CSS",
      "React Router DOM",
      "Chart.js",
      "react-chartjs-2",
      "PWA",
      "Service Worker",
      "LocalStorage",
      "Create React App",
      "PostCSS",
      "Autoprefixer",
      "React Testing Library"
    ],
    "liveUrl": "https://habitss-tracker.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/habit-tracker.jpg",
    "outcomes": "Modern React PWA with data visualization, responsive design, and excellent UX demonstrating proficiency in modern React development, PWA implementation, and user-friendly interface design."
  },
  {
    "id": 4,
    "title": "Event Countdown Timer",
    "description": "A modern, feature-rich countdown timer web application for creating and managing multiple countdowns for various life events.",
    "detailedDescription": "Perfect for tracking birthdays, anniversaries, graduations, and custom recurring events with automatic yearly repetition. Features include unlimited countdowns with list and individual views, recurring events with daily/weekly/monthly/yearly intervals, visual customization with color coding and themes, smart notifications with confetti animation and audio alerts, localStorage data persistence, and URL sharing for specific countdowns.",
    "technologies": [
      "HTML5",
      "CSS3",
      "Vanilla JavaScript",
      "ES6+",
      "localStorage API",
      "Web Audio API",
      "Canvas API",
      "File API",
      "Clipboard API",
      "CSS Grid",
      "Flexbox",
      "CSS Custom Properties",
      "Google Fonts",
      "Netlify"
    ],
    "liveUrl": "https://event-countdowns.netlify.app",
    "repoUrl": "https://github.com/Ancel-duke",
    "image": "/assets/projects/events.jpg",
    "outcomes": "Lightweight, fast-loading vanilla JavaScript application demonstrating modern web development best practices without frameworks, featuring responsive design, browser APIs integration, and excellent performance."
  }
]
